import streamlit as st
st.title("2026.08.29 회고록")
st.markdown("""오늘 나는 클로드의 러닝모드를 활용하여 kbo 승률 예측 웹사이트를 
만들기를 시작했다. 파이썬 수업을 들으면서 접하고 들어보긴 햇지만 직접 파이썬을 이용하여
만들고 실습한 경험은 많지 않고 ai를 이용하여 만들게 되면 잘 만들어주고 결과물이 좋게 나오지만
내가 그 결과물을 제대로 이해하고 왜 그렇게 만들었는지 설명하기가 어렵기에 이 방법이 아주 좋다고 생각했다
오늘은 파이썬 기초문법을 진단해보았는데 직접 코드를 작성한 경험이 많지 않아서 어색하였지만 
쥬피터 노트북을 통해 계속 실습하고 틀린점을 고치고 문제를 푸는 과정에서 내가 모르는 부분을 알게되었다.
함수 매개변수에서 def_grade(avg)에서 avg가 특정 값 기준으로 출력되는 것이 다른 함수를 완성 할 때 매개변수인 avg를 신경 안쓰고 
앞서 했던 문제인 딕셔너리로 해야하는 줄알고 코드를 문제 의도와는 맞지않게 짯다. 그 부분을 확인 할 수 있었고 return과 print의 차이
를 알게되었다. return은 함수의 결과값을 반환하는 것이고 print는 화면에 출력하는 것이라는 것을 알게되었다.
딕셔너리 문법이나 리스트 문법, json 문법을 활용하여 데이터 파일을 만들고 데이터를 선택하는 과정을 알고 직접 
코드를 짤 수 있게 되었다! streamlit을 활용하여 배포는 아직 못하고 아직까진 조금의 글씨밖에는 없지만 직접 결과가 뜨는 
화면을 만들어 보았다. """)